IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM7_CONTROLSS_G3_EPWM7.xml
	<register id="CONTROLSS_G3_EPWM7_VCNTCFG" acronym="CONTROLSS_G3_EPWM7_VCNTCFG" offset="0x32" width="16" description="Valley Counter Config Register">
		<bitfield id="STOPEDGESTS" width="1" begin="15" end="15" resetval="0x0" description="Stop Edge Status Bit   0: Stop edge has not occurred  1: Stop edge occurred  Note: This bit is set only after the trigger sequence is armed [upon occurrence of trigger pulse selected through VCAPCTL[TRIGSEL]] and STOPEDGE occurs.  Note:This bit is reset by the occurrence of the trigger pulse selected through VCAPCTL[TRIGSEL]" range="15" rwaccess="R"/> 
		<bitfield id="STOPEDGE" width="4" begin="11" end="8" resetval="0x0" description="Counter Stop Edge Selection  Once the counter operation is armed, upon occurrence of trigger pulse selected through VCAPCTL[TRIGSEL] pulse - valley counter would stop counting upon the occurrence of chosen number of events thorough this bit field. Stop counting on occurrence of:   0000: Do not stop  0001  1st edge  0010: 2nd edge  0011: 3rd edge  ...  1,1,1,1: 15th edge" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="STARTEDGESTS" width="1" begin="7" end="7" resetval="0x0" description="Start Edge Status Bit   0: Start edge has not occurred  1: Start edge occurred  Note: This bit is set only after the trigger sequence is armed [upon occurrence of trigger pulse selected through VCAPCTL[TRIGSEL]] and STARTEDGE occurs.  Note:This bit is reset by the occurrence of the trigger pulse selected through VCAPCTL[TRIGSEL]" range="7" rwaccess="R"/> 
		<bitfield id="STARTEDGE" width="4" begin="3" end="0" resetval="0x0" description="Counter Start Edge Selection  Once the counter operation is armed, upon occurrence of trigger pulse selected through VCAPCTL[TRIGSEL] pulse - valley counter would start counting upon the occurrence of chosen number of events thorough this bit field. Start counting on occurrence of    0000: Do not start  0001: 1st edge  0010: 2nd edge  0011: 3rd edge  ...  1111: 15th edge" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM7_HRCNFG" acronym="CONTROLSS_G3_EPWM7_HRCNFG" offset="0x40" width="16" description="HRPWM Configuration Register [[br]] [[br]]This register is only accessible on EPWM modules with HRPWM capabilities.">
		<bitfield id="LINESEL" width="2" begin="15" end="14" resetval="0x0" description="Delay Line Selection Bits: Selects which of the 4 delay lines for a particular ePWM/EPWM module to send to CALIN for calibration." range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="HRLOADB" width="2" begin="12" end="11" resetval="0x0" description="Shadow Mode Bit  Selects the time event that loads the CMPBHR shadow value into the active register.   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Load on CMPB_EQ [Translator Event CMPB-3]  " range="12 - 11" rwaccess="R/W"/> 
		<bitfield id="CTLMODEB" width="1" begin="10" end="10" resetval="0x0" description="Control Mode Bits  Selects the register [CMP/TBPRD or TBPHS] that controls the MEP:   0: CMPBHR[8] or TBPRDHR[8] Register controls the edge position [i.e., this is duty or period control mode]. [Default on Reset]  1: TBPHSHR[8] Register controls the edge position [i.e., this is phase control mode]." range="10" rwaccess="R/W"/> 
		<bitfield id="EDGMODEB" width="2" begin="9" end="8" resetval="0x0" description="Edge Mode Bits  Selects the edge of the PWM that is controlled by the micro-edge position [MEP] logic:   00: HRPWM capability is disabled [default on reset]  01: MEP control of rising edge [CMPBHR]  10: MEP control of falling edge [CMPBHR]  11: MEP control of both edges [TBPHSHR or TBPRDHR]" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SWAPAB" width="1" begin="7" end="7" resetval="0x0" description="Swap ePWM A &#38; B Output Signals  This bit enables the swapping of the A &#38; B signal outputs. The selection is as follows:   0: ePWMxA and ePWMxB outputs are unchanged.  1: ePWMxA signal appears on ePWMxB output and ePWMxB signal appears on ePWMxA output." range="7" rwaccess="R/W"/> 
		<bitfield id="AUTOCONV" width="1" begin="6" end="6" resetval="0x0" description="Auto Convert Delay Line Value  Selects whether the fractional duty cycle/period/phase in the CMPAHR/TBPRDHR/TBPHSHR register is automatically scaled by the MEP scale factor in the HRMSTEP register or manually scaled by calculations in application software. The SFO library function automatically updates the HRMSTEP register with the appropriate MEP scale factor.   0: Automatic HRMSTEP scaling is disabled.  1: Automatic HRMSTEP scaling is enabled.  If application software is manually scaling the fractional duty cycle, or phase [i.e. software sets CMPAHR = [fraction[PWMduty * PWMperiod] * MEP Scale Factor]&#38;#60;&#38;#60;8 + 0x080 for duty cycle], then this mode must be disabled." range="6" rwaccess="R/W"/> 
		<bitfield id="SELOUTB" width="1" begin="5" end="5" resetval="0x0" description="EPWMxB Output Select Bit  This bit selects which signal is output on the ePWMxB channel output. The inversion will take the high resolution mode into account and the inverted signal will contain any high resolution modification. The inversion takes place as the last step in modifying the ePWMxB signal.   0: ePWMxB output is normal.  1: ePWMxB output is inverted version of ePWMxA signal." range="5" rwaccess="R/W"/> 
		<bitfield id="HRLOAD" width="2" begin="4" end="3" resetval="0x0" description="Shadow Mode Bit  Selects the time event that loads the CMPAHR shadow value into the active register.   00: Load on CTR = Zero: Time-base counter equal to zero [TBCTR = 0x0000]  01: Load on CTR = PRD: Time-base counter equal to period [TBCTR = TBPRD]  10: Load on either CTR = Zero or CTR = PRD  11: Load on CMPA_EQ [Translator Event CMPA-3]  " range="4 - 3" rwaccess="R/W"/> 
		<bitfield id="CTLMODE" width="1" begin="2" end="2" resetval="0x0" description="Control Mode Bits  Selects the register [CMP/TBPRD or TBPHS] that controls the MEP:   0: CMPAHR[8] or TBPRDHR[8] Register controls the edge position [i.e., this is duty or period control mode]. [Default on Reset]  1: TBPHSHR[8] Register controls the edge position [i.e., this is phase control mode]." range="2" rwaccess="R/W"/> 
		<bitfield id="EDGMODE" width="2" begin="1" end="0" resetval="0x0" description="Edge Mode Bits  Selects the edge of the PWM that is controlled by the micro-edge position [MEP] logic:   00: HRPWM capability is disabled [default on reset]  01: MEP control of rising edge [CMPAHR]  10: MEP control of falling edge [CMPAHR]  11: MEP control of both edges [TBPHSHR or TBPRDHR]" range="1 - 0" rwaccess="R/W"/>
	</register>
